test/tests/multiapps/energy_conserved_in_simple_conduction_example/buoyantCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.2;

writeControl    timeStep;

writeInterval   10;

purgeWrite      10;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  writeProperties
  {
    type            writeObjects;
    libs            ("libutilityFunctionObjects.so");
    log             true;
    writeControl    timeStep;
    writeInterval   10;
    objects
    (
      rho
      h
      U
    );
  }
}

// ************************************************************************* //
