test/tests/multiapps/energy_conserved_in_simple_conduction_example/buoyantCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
2500
(
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
...
)
;

boundaryField
{
    back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
2500
(
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
...
)
;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0.110222763891215;
    }
    left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
50
(
0.115035824579536
0.117313761700643
0.11959169882175
0.121869635928306
0.124147573049413
0.12642551017052
0.128703447291628
0.130981384412735
...
)
;
    }
    front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
2500
(
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
0.115035824579536
...
)
;
    }
    right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
50
(
0.115035824579536
0.117313761700643
0.11959169882175
0.121869635928306
0.124147573049413
0.12642551017052
0.128703447291628
0.130981384412735
...
)
;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0.227793712023413;
    }
}


// ************************************************************************* //
